zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VS_MII_MMD.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_VS_MII_MMD.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_VS_MII_MMD
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_VS_MII_MMD_H_)  /* Check if memory map has not been already included */
#define S32K566_VS_MII_MMD_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- VS_MII_MMD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VS_MII_MMD_Peripheral_Access_Layer VS_MII_MMD Peripheral Access Layer
 * @{
 */

/** VS_MII_MMD - Register Layout Typedef */
typedef struct VS_MII_MMD_Struct {
  __IO uint16_t SR_MII_CTRL;                       /**< SR MII MMD Control Register The host can use this register to control (enable or disable) some of the features supported by the DWC_xpcs with 1G (1000BASE-X) or USXGMII support) and Clause 37 auto-negotiation support., offset: 0x0 */
  __I  uint16_t SR_MII_STS;                        /**< SR MII MMD Status Register The host uses this register to know the features supported by the DWC_xpcs in the 1000BASE-X mode., offset: 0x2 */
  __I  uint16_t SR_MII_DEV_ID1;                    /**< SR MII MMD Device Identifier Register 1 This register returns the configurable Organizationally Unique Identifier (OUI) to the host., offset: 0x4 */
  __I  uint16_t SR_MII_DEV_ID2;                    /**< SR MII MMD Device Identifier Register 2 This register returns the configurable Organizationally Unique Identifier (OUI), Model Number, and Revision Number of the device to the host., offset: 0x6 */
  __IO uint16_t SR_MII_AN_ADV;                     /**< SR MII MMD AN Advertisement Register The host uses this register to advertise the abilities and status of the local device to its link partner through Clause 37 auto-negotiation protocol., offset: 0x8 */
  __I  uint16_t SR_MII_LP_BABL;                    /**< SR_MII_LP_BABL, offset: 0xA */
  __I  uint16_t SR_MII_AN_EXPN;                    /**< SR MII MMD AN Expansion Register, offset: 0xC */
  uint8_t RESERVED_0[16];
  __I  uint16_t SR_MII_EXT_STS;                    /**< SR MII MMD Extended Status Register This register is present only for configurations with 1G/KX support., offset: 0x1E */
  uint8_t RESERVED_1[65504];
  __IO uint16_t VR_MII_DIG_CTRL1;                  /**< VR MII MMD Digital Control1 Register, offset: 0x10000 */
  __IO uint16_t VR_MII_AN_CTRL;                    /**< VR MII MMD AN Control Register, offset: 0x10002 */
  __IO uint16_t VR_MII_AN_INTR_STS;                /**< VR MII MMD AN Interrupt and Status Register, offset: 0x10004 */
  uint8_t RESERVED_2[14];
  __IO uint16_t VR_MII_LINK_TIMER_CTRL;            /**< VR MII MMD Link Timer Control Register, offset: 0x10014 */
} VS_MII_MMD_Type, *VS_MII_MMD_MemMapPtr;

/** Number of instances of the VS_MII_MMD module. */
#define VS_MII_MMD_INSTANCE_COUNT                (1u)

/* VS_MII_MMD - Peripheral instance base addresses */
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__VS_MII_MMD base address */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__VS_MII_MMD_BASE (0xBE0000u)
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__VS_MII_MMD base pointer */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__VS_MII_MMD ((VS_MII_MMD_Type *)IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__VS_MII_MMD_BASE)
/** Array initializer of VS_MII_MMD peripheral base addresses */
#define IP_VS_MII_MMD_BASE_ADDRS                 { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__VS_MII_MMD_BASE }
/** Array initializer of VS_MII_MMD peripheral base pointers */
#define IP_VS_MII_MMD_BASE_PTRS                  { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__VS_MII_MMD }

/* ----------------------------------------------------------------------------
   -- VS_MII_MMD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VS_MII_MMD_Register_Masks VS_MII_MMD Register Masks
 * @{
 */

/*! @name SR_MII_CTRL - SR MII MMD Control Register The host can use this register to control (enable or disable) some of the features supported by the DWC_xpcs with 1G (1000BASE-X) or USXGMII support) and Clause 37 auto-negotiation support. */
/*! @{ */

#define VS_MII_MMD_SR_MII_CTRL_SS6_MASK          (0x40U)
#define VS_MII_MMD_SR_MII_CTRL_SS6_SHIFT         (6U)
#define VS_MII_MMD_SR_MII_CTRL_SS6_WIDTH         (1U)
#define VS_MII_MMD_SR_MII_CTRL_SS6(x)            (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_CTRL_SS6_SHIFT)) & VS_MII_MMD_SR_MII_CTRL_SS6_MASK)

#define VS_MII_MMD_SR_MII_CTRL_DUPLEX_MODE_MASK  (0x100U)
#define VS_MII_MMD_SR_MII_CTRL_DUPLEX_MODE_SHIFT (8U)
#define VS_MII_MMD_SR_MII_CTRL_DUPLEX_MODE_WIDTH (1U)
#define VS_MII_MMD_SR_MII_CTRL_DUPLEX_MODE(x)    (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_CTRL_DUPLEX_MODE_SHIFT)) & VS_MII_MMD_SR_MII_CTRL_DUPLEX_MODE_MASK)

