zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VS_MII_MMD.h
#define VS_MII_MMD_SR_MII_CTRL_RESTART_AN_MASK   (0x200U)
#define VS_MII_MMD_SR_MII_CTRL_RESTART_AN_SHIFT  (9U)
#define VS_MII_MMD_SR_MII_CTRL_RESTART_AN_WIDTH  (1U)
#define VS_MII_MMD_SR_MII_CTRL_RESTART_AN(x)     (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_CTRL_RESTART_AN_SHIFT)) & VS_MII_MMD_SR_MII_CTRL_RESTART_AN_MASK)

#define VS_MII_MMD_SR_MII_CTRL_LPM_MASK          (0x800U)
#define VS_MII_MMD_SR_MII_CTRL_LPM_SHIFT         (11U)
#define VS_MII_MMD_SR_MII_CTRL_LPM_WIDTH         (1U)
#define VS_MII_MMD_SR_MII_CTRL_LPM(x)            (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_CTRL_LPM_SHIFT)) & VS_MII_MMD_SR_MII_CTRL_LPM_MASK)

#define VS_MII_MMD_SR_MII_CTRL_AN_ENABLE_MASK    (0x1000U)
#define VS_MII_MMD_SR_MII_CTRL_AN_ENABLE_SHIFT   (12U)
#define VS_MII_MMD_SR_MII_CTRL_AN_ENABLE_WIDTH   (1U)
#define VS_MII_MMD_SR_MII_CTRL_AN_ENABLE(x)      (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_CTRL_AN_ENABLE_SHIFT)) & VS_MII_MMD_SR_MII_CTRL_AN_ENABLE_MASK)

#define VS_MII_MMD_SR_MII_CTRL_SS13_MASK         (0x2000U)
#define VS_MII_MMD_SR_MII_CTRL_SS13_SHIFT        (13U)
#define VS_MII_MMD_SR_MII_CTRL_SS13_WIDTH        (1U)
#define VS_MII_MMD_SR_MII_CTRL_SS13(x)           (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_CTRL_SS13_SHIFT)) & VS_MII_MMD_SR_MII_CTRL_SS13_MASK)

#define VS_MII_MMD_SR_MII_CTRL_LBE_MASK          (0x4000U)
#define VS_MII_MMD_SR_MII_CTRL_LBE_SHIFT         (14U)
#define VS_MII_MMD_SR_MII_CTRL_LBE_WIDTH         (1U)
#define VS_MII_MMD_SR_MII_CTRL_LBE(x)            (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_CTRL_LBE_SHIFT)) & VS_MII_MMD_SR_MII_CTRL_LBE_MASK)

#define VS_MII_MMD_SR_MII_CTRL_RST_MASK          (0x8000U)
#define VS_MII_MMD_SR_MII_CTRL_RST_SHIFT         (15U)
#define VS_MII_MMD_SR_MII_CTRL_RST_WIDTH         (1U)
#define VS_MII_MMD_SR_MII_CTRL_RST(x)            (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_CTRL_RST_SHIFT)) & VS_MII_MMD_SR_MII_CTRL_RST_MASK)
/*! @} */

/*! @name SR_MII_STS - SR MII MMD Status Register The host uses this register to know the features supported by the DWC_xpcs in the 1000BASE-X mode. */
/*! @{ */

#define VS_MII_MMD_SR_MII_STS_EXT_REG_CAP_MASK   (0x1U)
#define VS_MII_MMD_SR_MII_STS_EXT_REG_CAP_SHIFT  (0U)
#define VS_MII_MMD_SR_MII_STS_EXT_REG_CAP_WIDTH  (1U)
#define VS_MII_MMD_SR_MII_STS_EXT_REG_CAP(x)     (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_EXT_REG_CAP_SHIFT)) & VS_MII_MMD_SR_MII_STS_EXT_REG_CAP_MASK)

#define VS_MII_MMD_SR_MII_STS_LINK_STS_MASK      (0x4U)
#define VS_MII_MMD_SR_MII_STS_LINK_STS_SHIFT     (2U)
#define VS_MII_MMD_SR_MII_STS_LINK_STS_WIDTH     (1U)
#define VS_MII_MMD_SR_MII_STS_LINK_STS(x)        (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_LINK_STS_SHIFT)) & VS_MII_MMD_SR_MII_STS_LINK_STS_MASK)

#define VS_MII_MMD_SR_MII_STS_AN_ABL_MASK        (0x8U)
#define VS_MII_MMD_SR_MII_STS_AN_ABL_SHIFT       (3U)
#define VS_MII_MMD_SR_MII_STS_AN_ABL_WIDTH       (1U)
#define VS_MII_MMD_SR_MII_STS_AN_ABL(x)          (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_AN_ABL_SHIFT)) & VS_MII_MMD_SR_MII_STS_AN_ABL_MASK)

#define VS_MII_MMD_SR_MII_STS_RF_MASK            (0x10U)
#define VS_MII_MMD_SR_MII_STS_RF_SHIFT           (4U)
#define VS_MII_MMD_SR_MII_STS_RF_WIDTH           (1U)
#define VS_MII_MMD_SR_MII_STS_RF(x)              (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_RF_SHIFT)) & VS_MII_MMD_SR_MII_STS_RF_MASK)

#define VS_MII_MMD_SR_MII_STS_AN_CMPL_MASK       (0x20U)
#define VS_MII_MMD_SR_MII_STS_AN_CMPL_SHIFT      (5U)
#define VS_MII_MMD_SR_MII_STS_AN_CMPL_WIDTH      (1U)
#define VS_MII_MMD_SR_MII_STS_AN_CMPL(x)         (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_AN_CMPL_SHIFT)) & VS_MII_MMD_SR_MII_STS_AN_CMPL_MASK)

#define VS_MII_MMD_SR_MII_STS_MF_PRE_SUP_MASK    (0x40U)
#define VS_MII_MMD_SR_MII_STS_MF_PRE_SUP_SHIFT   (6U)
#define VS_MII_MMD_SR_MII_STS_MF_PRE_SUP_WIDTH   (1U)
#define VS_MII_MMD_SR_MII_STS_MF_PRE_SUP(x)      (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_MF_PRE_SUP_SHIFT)) & VS_MII_MMD_SR_MII_STS_MF_PRE_SUP_MASK)

#define VS_MII_MMD_SR_MII_STS_UN_DIR_ABL_MASK    (0x80U)
#define VS_MII_MMD_SR_MII_STS_UN_DIR_ABL_SHIFT   (7U)
#define VS_MII_MMD_SR_MII_STS_UN_DIR_ABL_WIDTH   (1U)
#define VS_MII_MMD_SR_MII_STS_UN_DIR_ABL(x)      (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_UN_DIR_ABL_SHIFT)) & VS_MII_MMD_SR_MII_STS_UN_DIR_ABL_MASK)

#define VS_MII_MMD_SR_MII_STS_EXT_STS_ABL_MASK   (0x100U)
#define VS_MII_MMD_SR_MII_STS_EXT_STS_ABL_SHIFT  (8U)
#define VS_MII_MMD_SR_MII_STS_EXT_STS_ABL_WIDTH  (1U)
#define VS_MII_MMD_SR_MII_STS_EXT_STS_ABL(x)     (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_EXT_STS_ABL_SHIFT)) & VS_MII_MMD_SR_MII_STS_EXT_STS_ABL_MASK)

#define VS_MII_MMD_SR_MII_STS_HD100T_MASK        (0x200U)
#define VS_MII_MMD_SR_MII_STS_HD100T_SHIFT       (9U)
#define VS_MII_MMD_SR_MII_STS_HD100T_WIDTH       (1U)
#define VS_MII_MMD_SR_MII_STS_HD100T(x)          (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_HD100T_SHIFT)) & VS_MII_MMD_SR_MII_STS_HD100T_MASK)

#define VS_MII_MMD_SR_MII_STS_FD100T_MASK        (0x400U)
#define VS_MII_MMD_SR_MII_STS_FD100T_SHIFT       (10U)
#define VS_MII_MMD_SR_MII_STS_FD100T_WIDTH       (1U)
#define VS_MII_MMD_SR_MII_STS_FD100T(x)          (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_FD100T_SHIFT)) & VS_MII_MMD_SR_MII_STS_FD100T_MASK)

#define VS_MII_MMD_SR_MII_STS_HD10ABL_MASK       (0x800U)
#define VS_MII_MMD_SR_MII_STS_HD10ABL_SHIFT      (11U)
#define VS_MII_MMD_SR_MII_STS_HD10ABL_WIDTH      (1U)
#define VS_MII_MMD_SR_MII_STS_HD10ABL(x)         (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_HD10ABL_SHIFT)) & VS_MII_MMD_SR_MII_STS_HD10ABL_MASK)

#define VS_MII_MMD_SR_MII_STS_FD10ABL_MASK       (0x1000U)
#define VS_MII_MMD_SR_MII_STS_FD10ABL_SHIFT      (12U)
#define VS_MII_MMD_SR_MII_STS_FD10ABL_WIDTH      (1U)
#define VS_MII_MMD_SR_MII_STS_FD10ABL(x)         (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_FD10ABL_SHIFT)) & VS_MII_MMD_SR_MII_STS_FD10ABL_MASK)

#define VS_MII_MMD_SR_MII_STS_HD100ABL_MASK      (0x2000U)
#define VS_MII_MMD_SR_MII_STS_HD100ABL_SHIFT     (13U)
#define VS_MII_MMD_SR_MII_STS_HD100ABL_WIDTH     (1U)
#define VS_MII_MMD_SR_MII_STS_HD100ABL(x)        (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_HD100ABL_SHIFT)) & VS_MII_MMD_SR_MII_STS_HD100ABL_MASK)

#define VS_MII_MMD_SR_MII_STS_FD100ABL_MASK      (0x4000U)
#define VS_MII_MMD_SR_MII_STS_FD100ABL_SHIFT     (14U)
#define VS_MII_MMD_SR_MII_STS_FD100ABL_WIDTH     (1U)
#define VS_MII_MMD_SR_MII_STS_FD100ABL(x)        (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_FD100ABL_SHIFT)) & VS_MII_MMD_SR_MII_STS_FD100ABL_MASK)

#define VS_MII_MMD_SR_MII_STS_ABL100T4_MASK      (0x8000U)
#define VS_MII_MMD_SR_MII_STS_ABL100T4_SHIFT     (15U)
#define VS_MII_MMD_SR_MII_STS_ABL100T4_WIDTH     (1U)
#define VS_MII_MMD_SR_MII_STS_ABL100T4(x)        (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_STS_ABL100T4_SHIFT)) & VS_MII_MMD_SR_MII_STS_ABL100T4_MASK)
/*! @} */

/*! @name SR_MII_DEV_ID1 - SR MII MMD Device Identifier Register 1 This register returns the configurable Organizationally Unique Identifier (OUI) to the host. */
/*! @{ */

