zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VS_MII_MMD.h
#define VS_MII_MMD_SR_MII_DEV_ID1_VS_MII_DEV_OUI_3_18_MASK (0xFFFFU)
#define VS_MII_MMD_SR_MII_DEV_ID1_VS_MII_DEV_OUI_3_18_SHIFT (0U)
#define VS_MII_MMD_SR_MII_DEV_ID1_VS_MII_DEV_OUI_3_18_WIDTH (16U)
#define VS_MII_MMD_SR_MII_DEV_ID1_VS_MII_DEV_OUI_3_18(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_DEV_ID1_VS_MII_DEV_OUI_3_18_SHIFT)) & VS_MII_MMD_SR_MII_DEV_ID1_VS_MII_DEV_OUI_3_18_MASK)
/*! @} */

/*! @name SR_MII_DEV_ID2 - SR MII MMD Device Identifier Register 2 This register returns the configurable Organizationally Unique Identifier (OUI), Model Number, and Revision Number of the device to the host. */
/*! @{ */

#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_RN_3_0_MASK (0xFU)
#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_RN_3_0_SHIFT (0U)
#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_RN_3_0_WIDTH (4U)
#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_RN_3_0(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_RN_3_0_SHIFT)) & VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_RN_3_0_MASK)

#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_MMN_5_0_MASK (0x3F0U)
#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_MMN_5_0_SHIFT (4U)
#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_MMN_5_0_WIDTH (6U)
#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_MMN_5_0(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_MMN_5_0_SHIFT)) & VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_MMN_5_0_MASK)

#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_OUI_19_24_MASK (0xFC00U)
#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_OUI_19_24_SHIFT (10U)
#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_OUI_19_24_WIDTH (6U)
#define VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_OUI_19_24(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_OUI_19_24_SHIFT)) & VS_MII_MMD_SR_MII_DEV_ID2_VS_MMD_DEV_OUI_19_24_MASK)
/*! @} */

/*! @name SR_MII_AN_ADV - SR MII MMD AN Advertisement Register The host uses this register to advertise the abilities and status of the local device to its link partner through Clause 37 auto-negotiation protocol. */
/*! @{ */

#define VS_MII_MMD_SR_MII_AN_ADV_FD_MASK         (0x20U)
#define VS_MII_MMD_SR_MII_AN_ADV_FD_SHIFT        (5U)
#define VS_MII_MMD_SR_MII_AN_ADV_FD_WIDTH        (1U)
#define VS_MII_MMD_SR_MII_AN_ADV_FD(x)           (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_AN_ADV_FD_SHIFT)) & VS_MII_MMD_SR_MII_AN_ADV_FD_MASK)

#define VS_MII_MMD_SR_MII_AN_ADV_HD_MASK         (0x40U)
#define VS_MII_MMD_SR_MII_AN_ADV_HD_SHIFT        (6U)
#define VS_MII_MMD_SR_MII_AN_ADV_HD_WIDTH        (1U)
#define VS_MII_MMD_SR_MII_AN_ADV_HD(x)           (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_AN_ADV_HD_SHIFT)) & VS_MII_MMD_SR_MII_AN_ADV_HD_MASK)

#define VS_MII_MMD_SR_MII_AN_ADV_PAUSE_MASK      (0x180U)
#define VS_MII_MMD_SR_MII_AN_ADV_PAUSE_SHIFT     (7U)
#define VS_MII_MMD_SR_MII_AN_ADV_PAUSE_WIDTH     (2U)
#define VS_MII_MMD_SR_MII_AN_ADV_PAUSE(x)        (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_AN_ADV_PAUSE_SHIFT)) & VS_MII_MMD_SR_MII_AN_ADV_PAUSE_MASK)

#define VS_MII_MMD_SR_MII_AN_ADV_RF_MASK         (0x3000U)
#define VS_MII_MMD_SR_MII_AN_ADV_RF_SHIFT        (12U)
#define VS_MII_MMD_SR_MII_AN_ADV_RF_WIDTH        (2U)
#define VS_MII_MMD_SR_MII_AN_ADV_RF(x)           (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_AN_ADV_RF_SHIFT)) & VS_MII_MMD_SR_MII_AN_ADV_RF_MASK)

#define VS_MII_MMD_SR_MII_AN_ADV_NP_MASK         (0x8000U)
#define VS_MII_MMD_SR_MII_AN_ADV_NP_SHIFT        (15U)
#define VS_MII_MMD_SR_MII_AN_ADV_NP_WIDTH        (1U)
#define VS_MII_MMD_SR_MII_AN_ADV_NP(x)           (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_AN_ADV_NP_SHIFT)) & VS_MII_MMD_SR_MII_AN_ADV_NP_MASK)
/*! @} */

/*! @name SR_MII_LP_BABL - SR_MII_LP_BABL */
/*! @{ */

#define VS_MII_MMD_SR_MII_LP_BABL_LP_FD_MASK     (0x20U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_FD_SHIFT    (5U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_FD_WIDTH    (1U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_FD(x)       (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_LP_BABL_LP_FD_SHIFT)) & VS_MII_MMD_SR_MII_LP_BABL_LP_FD_MASK)

#define VS_MII_MMD_SR_MII_LP_BABL_LP_HD_MASK     (0x40U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_HD_SHIFT    (6U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_HD_WIDTH    (1U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_HD(x)       (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_LP_BABL_LP_HD_SHIFT)) & VS_MII_MMD_SR_MII_LP_BABL_LP_HD_MASK)

#define VS_MII_MMD_SR_MII_LP_BABL_LP_PAUSE_MASK  (0x180U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_PAUSE_SHIFT (7U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_PAUSE_WIDTH (2U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_PAUSE(x)    (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_LP_BABL_LP_PAUSE_SHIFT)) & VS_MII_MMD_SR_MII_LP_BABL_LP_PAUSE_MASK)

#define VS_MII_MMD_SR_MII_LP_BABL_LP_RF_MASK     (0x3000U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_RF_SHIFT    (12U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_RF_WIDTH    (2U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_RF(x)       (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_LP_BABL_LP_RF_SHIFT)) & VS_MII_MMD_SR_MII_LP_BABL_LP_RF_MASK)

#define VS_MII_MMD_SR_MII_LP_BABL_LP_ACK_MASK    (0x4000U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_ACK_SHIFT   (14U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_ACK_WIDTH   (1U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_ACK(x)      (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_LP_BABL_LP_ACK_SHIFT)) & VS_MII_MMD_SR_MII_LP_BABL_LP_ACK_MASK)

#define VS_MII_MMD_SR_MII_LP_BABL_LP_NP_MASK     (0x8000U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_NP_SHIFT    (15U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_NP_WIDTH    (1U)
#define VS_MII_MMD_SR_MII_LP_BABL_LP_NP(x)       (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_LP_BABL_LP_NP_SHIFT)) & VS_MII_MMD_SR_MII_LP_BABL_LP_NP_MASK)
/*! @} */

/*! @name SR_MII_AN_EXPN - SR MII MMD AN Expansion Register */
/*! @{ */

#define VS_MII_MMD_SR_MII_AN_EXPN_PG_RCVD_MASK   (0x2U)
#define VS_MII_MMD_SR_MII_AN_EXPN_PG_RCVD_SHIFT  (1U)
#define VS_MII_MMD_SR_MII_AN_EXPN_PG_RCVD_WIDTH  (1U)
#define VS_MII_MMD_SR_MII_AN_EXPN_PG_RCVD(x)     (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_AN_EXPN_PG_RCVD_SHIFT)) & VS_MII_MMD_SR_MII_AN_EXPN_PG_RCVD_MASK)

#define VS_MII_MMD_SR_MII_AN_EXPN_LD_NP_ABL_MASK (0x4U)
#define VS_MII_MMD_SR_MII_AN_EXPN_LD_NP_ABL_SHIFT (2U)
#define VS_MII_MMD_SR_MII_AN_EXPN_LD_NP_ABL_WIDTH (1U)
#define VS_MII_MMD_SR_MII_AN_EXPN_LD_NP_ABL(x)   (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_AN_EXPN_LD_NP_ABL_SHIFT)) & VS_MII_MMD_SR_MII_AN_EXPN_LD_NP_ABL_MASK)
/*! @} */

