zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VS_MII_MMD.h
/*! @name SR_MII_EXT_STS - SR MII MMD Extended Status Register This register is present only for configurations with 1G/KX support. */
/*! @{ */

#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_HD_MASK (0x1000U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_HD_SHIFT (12U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_HD_WIDTH (1U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_HD(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_HD_SHIFT)) & VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_HD_MASK)

#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_FD_MASK (0x2000U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_FD_SHIFT (13U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_FD_WIDTH (1U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_FD(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_FD_SHIFT)) & VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_T_FD_MASK)

#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_HD_MASK (0x4000U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_HD_SHIFT (14U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_HD_WIDTH (1U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_HD(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_HD_SHIFT)) & VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_HD_MASK)

#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_FD_MASK (0x8000U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_FD_SHIFT (15U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_FD_WIDTH (1U)
#define VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_FD(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_FD_SHIFT)) & VS_MII_MMD_SR_MII_EXT_STS_CAP_1G_X_FD_MASK)
/*! @} */

/*! @name VR_MII_DIG_CTRL1 - VR MII MMD Digital Control1 Register */
/*! @{ */

#define VS_MII_MMD_VR_MII_DIG_CTRL1_PHY_MODE_CTRL_MASK (0x1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_PHY_MODE_CTRL_SHIFT (0U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_PHY_MODE_CTRL_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_PHY_MODE_CTRL(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_PHY_MODE_CTRL_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_PHY_MODE_CTRL_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_BYP_PWRUP_MASK (0x2U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_BYP_PWRUP_SHIFT (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_BYP_PWRUP_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_BYP_PWRUP(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_BYP_PWRUP_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_BYP_PWRUP_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_EN_2_5G_MODE_MASK (0x4U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_EN_2_5G_MODE_SHIFT (2U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_EN_2_5G_MODE_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_EN_2_5G_MODE(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_EN_2_5G_MODE_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_EN_2_5G_MODE_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_TMR_OVR_RIDE_MASK (0x8U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_TMR_OVR_RIDE_SHIFT (3U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_TMR_OVR_RIDE_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_TMR_OVR_RIDE(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_TMR_OVR_RIDE_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_TMR_OVR_RIDE_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_DTXLANED_0_MASK (0x10U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_DTXLANED_0_SHIFT (4U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_DTXLANED_0_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_DTXLANED_0(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_DTXLANED_0_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_DTXLANED_0_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_PRE_EMP_MASK (0x40U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_PRE_EMP_SHIFT (6U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_PRE_EMP_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_PRE_EMP(x)   (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_PRE_EMP_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_PRE_EMP_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_MSK_RD_ERR_MASK (0x80U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_MSK_RD_ERR_SHIFT (7U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_MSK_RD_ERR_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_MSK_RD_ERR(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_MSK_RD_ERR_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_MSK_RD_ERR_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_MAC_AUTO_SW_MASK (0x200U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_MAC_AUTO_SW_SHIFT (9U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_MAC_AUTO_SW_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_MAC_AUTO_SW(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_MAC_AUTO_SW_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_MAC_AUTO_SW_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_PWRSV_MASK   (0x800U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_PWRSV_SHIFT  (11U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_PWRSV_WIDTH  (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_PWRSV(x)     (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_PWRSV_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_PWRSV_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_BP_MASK (0x1000U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_BP_SHIFT (12U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_BP_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_BP(x)   (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_BP_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_CL37_BP_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_EN_VSMMD1_MASK (0x2000U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_EN_VSMMD1_SHIFT (13U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_EN_VSMMD1_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_EN_VSMMD1(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_EN_VSMMD1_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_EN_VSMMD1_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_R2TLBE_MASK  (0x4000U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_R2TLBE_SHIFT (14U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_R2TLBE_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_R2TLBE(x)    (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_R2TLBE_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_R2TLBE_MASK)

#define VS_MII_MMD_VR_MII_DIG_CTRL1_VR_RST_MASK  (0x8000U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_VR_RST_SHIFT (15U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_VR_RST_WIDTH (1U)
#define VS_MII_MMD_VR_MII_DIG_CTRL1_VR_RST(x)    (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_DIG_CTRL1_VR_RST_SHIFT)) & VS_MII_MMD_VR_MII_DIG_CTRL1_VR_RST_MASK)
/*! @} */

