zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VS_MII_MMD.h
/*! @name VR_MII_AN_CTRL - VR MII MMD AN Control Register */
/*! @{ */

#define VS_MII_MMD_VR_MII_AN_CTRL_MII_AN_INTR_EN_MASK (0x1U)
#define VS_MII_MMD_VR_MII_AN_CTRL_MII_AN_INTR_EN_SHIFT (0U)
#define VS_MII_MMD_VR_MII_AN_CTRL_MII_AN_INTR_EN_WIDTH (1U)
#define VS_MII_MMD_VR_MII_AN_CTRL_MII_AN_INTR_EN(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_AN_CTRL_MII_AN_INTR_EN_SHIFT)) & VS_MII_MMD_VR_MII_AN_CTRL_MII_AN_INTR_EN_MASK)

#define VS_MII_MMD_VR_MII_AN_CTRL_PCS_MODE_MASK  (0x6U)
#define VS_MII_MMD_VR_MII_AN_CTRL_PCS_MODE_SHIFT (1U)
#define VS_MII_MMD_VR_MII_AN_CTRL_PCS_MODE_WIDTH (2U)
#define VS_MII_MMD_VR_MII_AN_CTRL_PCS_MODE(x)    (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_AN_CTRL_PCS_MODE_SHIFT)) & VS_MII_MMD_VR_MII_AN_CTRL_PCS_MODE_MASK)

#define VS_MII_MMD_VR_MII_AN_CTRL_TX_CONFIG_MASK (0x8U)
#define VS_MII_MMD_VR_MII_AN_CTRL_TX_CONFIG_SHIFT (3U)
#define VS_MII_MMD_VR_MII_AN_CTRL_TX_CONFIG_WIDTH (1U)
#define VS_MII_MMD_VR_MII_AN_CTRL_TX_CONFIG(x)   (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_AN_CTRL_TX_CONFIG_SHIFT)) & VS_MII_MMD_VR_MII_AN_CTRL_TX_CONFIG_MASK)

#define VS_MII_MMD_VR_MII_AN_CTRL_SGMII_LINK_STS_MASK (0x10U)
#define VS_MII_MMD_VR_MII_AN_CTRL_SGMII_LINK_STS_SHIFT (4U)
#define VS_MII_MMD_VR_MII_AN_CTRL_SGMII_LINK_STS_WIDTH (1U)
#define VS_MII_MMD_VR_MII_AN_CTRL_SGMII_LINK_STS(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_AN_CTRL_SGMII_LINK_STS_SHIFT)) & VS_MII_MMD_VR_MII_AN_CTRL_SGMII_LINK_STS_MASK)

#define VS_MII_MMD_VR_MII_AN_CTRL_MII_CTRL_MASK  (0x100U)
#define VS_MII_MMD_VR_MII_AN_CTRL_MII_CTRL_SHIFT (8U)
#define VS_MII_MMD_VR_MII_AN_CTRL_MII_CTRL_WIDTH (1U)
#define VS_MII_MMD_VR_MII_AN_CTRL_MII_CTRL(x)    (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_AN_CTRL_MII_CTRL_SHIFT)) & VS_MII_MMD_VR_MII_AN_CTRL_MII_CTRL_MASK)

#define VS_MII_MMD_VR_MII_AN_CTRL_IND_TX_EN_MASK (0x200U)
#define VS_MII_MMD_VR_MII_AN_CTRL_IND_TX_EN_SHIFT (9U)
#define VS_MII_MMD_VR_MII_AN_CTRL_IND_TX_EN_WIDTH (1U)
#define VS_MII_MMD_VR_MII_AN_CTRL_IND_TX_EN(x)   (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_AN_CTRL_IND_TX_EN_SHIFT)) & VS_MII_MMD_VR_MII_AN_CTRL_IND_TX_EN_MASK)
/*! @} */

/*! @name VR_MII_AN_INTR_STS - VR MII MMD AN Interrupt and Status Register */
/*! @{ */

#define VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANCMPLT_INTR_MASK (0x1U)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANCMPLT_INTR_SHIFT (0U)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANCMPLT_INTR_WIDTH (1U)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANCMPLT_INTR(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANCMPLT_INTR_SHIFT)) & VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANCMPLT_INTR_MASK)

#define VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANSGM_STS_MASK (0x1EU)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANSGM_STS_SHIFT (1U)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANSGM_STS_WIDTH (4U)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANSGM_STS(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANSGM_STS_SHIFT)) & VS_MII_MMD_VR_MII_AN_INTR_STS_CL37_ANSGM_STS_MASK)

#define VS_MII_MMD_VR_MII_AN_INTR_STS_LP_EEE_CAP_MASK (0x20U)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_LP_EEE_CAP_SHIFT (5U)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_LP_EEE_CAP_WIDTH (1U)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_LP_EEE_CAP(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_AN_INTR_STS_LP_EEE_CAP_SHIFT)) & VS_MII_MMD_VR_MII_AN_INTR_STS_LP_EEE_CAP_MASK)

#define VS_MII_MMD_VR_MII_AN_INTR_STS_LP_CK_STP_MASK (0x40U)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_LP_CK_STP_SHIFT (6U)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_LP_CK_STP_WIDTH (1U)
#define VS_MII_MMD_VR_MII_AN_INTR_STS_LP_CK_STP(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_AN_INTR_STS_LP_CK_STP_SHIFT)) & VS_MII_MMD_VR_MII_AN_INTR_STS_LP_CK_STP_MASK)
/*! @} */

/*! @name VR_MII_LINK_TIMER_CTRL - VR MII MMD Link Timer Control Register */
/*! @{ */

#define VS_MII_MMD_VR_MII_LINK_TIMER_CTRL_CL37_LINK_TIME_MASK (0xFFFFU)
#define VS_MII_MMD_VR_MII_LINK_TIMER_CTRL_CL37_LINK_TIME_SHIFT (0U)
#define VS_MII_MMD_VR_MII_LINK_TIMER_CTRL_CL37_LINK_TIME_WIDTH (16U)
#define VS_MII_MMD_VR_MII_LINK_TIMER_CTRL_CL37_LINK_TIME(x) (((uint16_t)(((uint16_t)(x)) << VS_MII_MMD_VR_MII_LINK_TIMER_CTRL_CL37_LINK_TIME_SHIFT)) & VS_MII_MMD_VR_MII_LINK_TIMER_CTRL_CL37_LINK_TIME_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group VS_MII_MMD_Register_Masks */

/*!
 * @}
 */ /* end of group VS_MII_MMD_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_VS_MII_MMD_H_) */
